package com.example;
// 8) Напишите Java-программу, чтобы определить, является ли строка или число палиндромом, или нет.
//Чтобы проверить, является ли число или строка палиндромом или нет, вы можете использовать любую
//        переворачивающую строки программу, из описанных выше,.
//
//        Что вам нужно сделать, так это добавить один оператор if-else. Если исходная строка равна
//        перевернутой строке, то число является палиндромом, в противном случае - нет.
public class EightTask {
    public static void main(String[] args) {

    }
}
