package com.example;
//# 16) Напишите Java-программу, чтобы найти второе по величине число в массиве.
//        Ответ:
//
//        В этой программе мы инициализировали массив с 10 случайными элементами,
//        из которых мы собираемся найти второе по величине число. Далее мы создали
//        две целочисленные переменные, которым будем присваивать значения двух целых чисел
//        из массива - самого большого и второго по величине. Обе переменные изначально получают
//        значения первого по индексу элемента массива. Затем мы выводим на экран все элементы, используя цикл for.
//
//        Дальнейшая логика работы программы в том, чтобы используя цикл for обойти массив.
//
//        При обходе, если элемент массива с текущим индексом больше, чем значение, хранящееся в переменной
//        biggest, тогда переменной secondBiggest присваиваем значение, хранящееся в biggest, а переменной
//        biggest – новое наибольшее значение в соответствии со значением текущего элемента массива. Опять же,
//        если элемент по текущему индексу больше, чем secondBiggest, то присвойте secondBiggest значение этого элемента.
//
//        Это будет повторяться для каждой итерации и, в конечном итоге, после завершения обхода массива в цикле
//        вы получите элементы наибольший и второй по величине элементы массива в переменных biggest и secondBiggest соответственно.
public class SixteenTask {
    public static void main(String[] args) {

    }
}
